In [5]:
repeated_values =[2,3,4,5,6,6,7,8,8,9,9,9,4,4]

n_dict = {}

for ele in repeated_values:
    if ele in n_dict.keys():
        n_dict[ele]+=1
    else:
        n_dict[ele]=1
new_list = [i for i in n_dict.keys() if n_dict[i]>1]
print(new_list)

[4, 6, 8, 9]

In [6]:
#replace none with avg of that subject

data = {'Name': ['John', 'Mike', 'Emma', 'Alice'],
        'Math': [90, 80, None, 85],
        'Science': [95, 75, 88, None]}

In [7]:
import pandas as pd
df = pd.DataFrame(data)
df

    Name  Math  Science
0   John  90.0     95.0
1   Mike  80.0     75.0
2   Emma   NaN     88.0
3  Alice  85.0      NaN

In [8]:
df['Math'].mean()
df['Math'].fillna(df['Math'].mean(),inplace=True)

In [9]:
df

    Name  Math  Science
0   John  90.0     95.0
1   Mike  80.0     75.0
2   Emma  85.0     88.0
3  Alice  85.0      NaN

In [10]:
df['Science'].mean()
df['Science'].fillna(df['Science'].mean(),inplace=True)

In [11]:
df

    Name  Math  Science
0   John  90.0     95.0
1   Mike  80.0     75.0
2   Emma  85.0     88.0
3  Alice  85.0     86.0

emp_Data:  emp_id,

In [ ]:
# Replace None with NaN to ensure compatibility with pandas
df = df.replace({None: np.nan})

# For each column, replace NaN with the mean of that column
df['Math'].fillna(df['Math'].mean(), inplace=True)
df['Science'].fillna(df['Science'].mean(), inplace=True)

print(df)

In [12]:
#tyoe
#exp >5 add 5000 to existing salary
#exp >10 add 10K

In [13]:
data = {
    'Employee_ID':[101,102,103],
    'Name':['Alice','Bob','Charlie'],
    'Joining_Date':['2017-05-10','2015-06-25','2020-08-15'],
    'Salary':[60000,75000,50000]
}

In [14]:
df = pd.DataFrame(data)
df

   Employee_ID     Name Joining_Date  Salary
0          101    Alice   2017-05-10   60000
1          102      Bob   2015-06-25   75000
2          103  Charlie   2020-08-15   50000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Employee_ID   3 non-null      int64
 1   Name          3 non-null      object
 2   Joining_Date  3 non-null      object
 3   Salary        3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 224.0+ bytes

In [16]:
df['Joining_Date'] = pd.to_datetime(df['Joining_Date'])

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Employee_ID   3 non-null      int64
 1   Name          3 non-null      object
 2   Joining_Date  3 non-null      datetime64[ns]
 3   Salary        3 non-null      int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 224.0+ bytes

In [18]:
df

   Employee_ID     Name Joining_Date  Salary
0          101    Alice   2017-05-10   60000
1          102      Bob   2015-06-25   75000
2          103  Charlie   2020-08-15   50000

In [19]:

from datetime import datetime, timedelta

In [20]:
datetime.now()

datetime.datetime(2024, 10, 5, 10, 42, 4, 339047)

In [21]:
df['Total Yoe'] = df['Joining_Date'].apply( lambda x: datetime.now()-x)

In [22]:
data_patients = {'PatientID': [1, 2, 3, 4],                  'Age': [45, 52, 29, 60]}
 
data_visits = {'PatientID': [1, 1, 1, 2, 2, 3, 4, 4],                'VisitID': [101, 102, 103, 104, 105, 106, 107, 108],                'Diagnosis': ['Hypertension', 'Diabetes', 'Hypertension', 'Heart Disease', 'Heart Disease', 'Asthma', 'Hypertension', 'Hypertension']}

In [23]:
#patients visited more than twice

In [24]:
df_visits = pd.DataFrame(data_visits)

In [25]:
df_visits

   PatientID  VisitID      Diagnosis
0          1      101   Hypertension
1          1      102       Diabetes
2          1      103   Hypertension
3          2      104  Heart Disease
4          2      105  Heart Disease
5          3      106         Asthma
6          4      107   Hypertension
7          4      108   Hypertension

In [41]:
df_33 = df_visits.groupby('PatientID').agg(VisitID_count=('VisitID','count')).reset_index()

In [42]:
df_33

   PatientID  VisitID_count
0          1              3
1          2              2
2          3              1
3          4              2

In [40]:
df_33[df_33['VisitID']>1]

   PatientID  VisitID
0          1        3
1          2        2
3          4        2

In [27]:
df_1 = df_visits.groupby('PatientID').count().reset_index()

In [28]:
df_1

   PatientID  VisitID  Diagnosis
0          1        3          3
1          2        2          2
2          3        1          1
3          4        2          2

In [53]:
df_1['PatientID'][df_1.VisitID > 1]

0    1
1    2
3    4
Name: PatientID, dtype: int64

In [56]:
df_2 = df_visits.groupby(['PatientID','Diagnosis']).count().reset_index()

In [57]:
df_2

   PatientID      Diagnosis  VisitID
0          1       Diabetes        1
1          1   Hypertension        2
2          2  Heart Disease        2
3          3         Asthma        1
4          4   Hypertension        2

In [59]:
df_2[['PatientID','Diagnosis']][df_2.VisitID>1]

   PatientID      Diagnosis
1          1   Hypertension
2          2  Heart Disease
4          4   Hypertension

In [ ]:
subscription_id,
customer_id,
subscription_start_date,
amount
subscription_end_date

#active subscriptions, inactive subscriptions 
#monthly basis

In [ ]:

select subscription_id,
        case when subscription_end_data < NOW() then 'Active'
    else 'Inactive' END as subscription_flag,
    concat(month(subscription_start_date),year(subscription_start_date))
    from subscription

In [ ]:
select customer_id, subscription_id,max(subscription_start_date)
from subscription
group by customer_id,subscription_id